**** Revealing Module Pattern - Singleton

#+BEGIN_SRC js :results output
  var scoreboard = function() {
    var message = 'Welcome to the Game!';
    function printMessage() {
      console.log(message);
    }
    return { showMessage: printMessage };
  }();

  scoreboard.showMessage();
#+END_SRC

#+RESULTS:
: Welcome to the Game!

**** Revealing Module Pattern - Constructor
In JS it is idiomatic to capitalize the first letter of a function's name when that function 
returns an object.

#+BEGIN_SRC js :results output
  var Scoreboard = function() {
    var message = 'Welcome to the Game!';
    function printMessage() {
      console.log(message);
    }
    return { showMessage: printMessage };
  };

  var scoreboard = Scoreboard();
  scoreboard.showMessage();
#+END_SRC

#+RESULTS:
: Welcome to the Game!

